{
    // 리액트 애플리케이션에서 reportWebVitals를 설치해서 지표를 수집하는 방식은 단순히 코드 몇 줄만으로 지표를 수집할 수 있다는 장점이 있지만
    // 그럼에도 기존 애플리케이션 코드의 수정이 필요하고 지표 수집을 위한 사전 준비가 필요하다는 번거로움이 있다

    // 구글 라이트 하우스를 사용하면 이런 변경점 없이 지표를 수집할 수 있다
}

{
    // 구글 라이트하우스
    // 구글에서 제공하는 웹 페이지 성능 측정 도구 
    // 핵심 웹 지표, 접근성, PWA, SEO 등 웹 페이지를 둘러싼 다양한 요소들을 측정하고 점검 가능

    // 라이트하우스 실행방법
    // 브라우저 확장 프로그램 설치: 브라우저의 웹 스토어에 접속해 확장 프로그램 설치
    // 크롬 개발자 도구: 크롬의 개발자 도구에는 라이트하우스가 기본적으로 내장
    // CLI: lighthouse라는 npm 라이브러리를 이용하면 CLI 명령어로 지표 수집 가능
    // lighthouse https://yceffort.kr
}